#120-102 优秀
#102-90 良好
#90-72 及格
#72-0 不及格
print('学生名单:张三\李二\刘一\李四 \王五\李明')
姓名=input('请输入想要查询的学生姓名：')
#姓名对应成绩 数组
成绩=[ ['张三',102],['李二',114],['刘一',69],['李四',93],['王五',63],['李明',119] ]

#分数评价并写入新的数组
for 小数组 in 成绩:
    if 小数组[0]==姓名:
        if 小数组[1]<=120 and 小数组[1]>=102:
            print(姓名,'同学单科成绩为',小数组[1],'，等级为','优秀')
        elif 小数组[1]<102 and 小数组[1]>=90:
            print(姓名,'同学单科成绩为',小数组[1],'，等级为','良好')
        elif 小数组[1]<90 and 小数组[1]>=72:
            print(姓名,'同学单科成绩为',小数组[1],'，等级为','及格')
        elif 小数组[1]<72 and 小数组[1]>=0:
            print(姓名,'同学单科成绩为',小数组[1],'，等级为','不及格')
        else:print('成绩错误')
        break
