a=0
b=0
#大循环，a!=0 时退出循环
while a==0:
    #小循环，b=1 时退出循环
    while b!=1:
        #询问查询哪位学生，列出所需字典（也可用数组+for in 函数替换）
        print('学生名单:张三\李四\王五\李华')
        姓名=input('请输入想要查询的学生姓名：')
        字典={'张三':118,'李四':115,'王五':97,'李华':63}
        #查询学生具体分数 并 进行评价
        if 字典[姓名]<=120 and 字典[姓名]>=102:
            print(姓名,'同学单科成绩为',字典[姓名],'，等级为','优秀')
        elif 字典[姓名]<102 and 字典[姓名]>=90:
            print(姓名,'同学单科成绩为',字典[姓名],'，等级为','良好')
        elif 字典[姓名]<90 and 字典[姓名]>=72:
            print(姓名,'同学单科成绩为',字典[姓名],'，等级为','及格')
        elif 字典[姓名]<72 and 字典[姓名]>=0:
            print(姓名,'同学单科成绩为',字典[姓名],'，等级为','不及格')
        else:print('成绩错误')
        #询问是否继续查询，根据回答，改变b值
        b=int( input('想要继续查询？  输入0继续 ，输入1结束') )    
    #改变a值    
    a=1
#显示感谢语
print('Thanks for your experience. ')
